Revit 2027 API
BuiltInFailures.EditingFailures.ElementsNotInPlane Property
 Elements don't lie on the same plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsNotInPlane { get; }
Public Shared ReadOnly Property ElementsNotInPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsNotInPlane {
	FailureDefinitionId^ get ();
}
static member ElementsNotInPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace